EMU/cscdw/Exsys/src/jbiasa/Exsys.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="Exsys"
             xmlns:tns="Exsys" xmlns:ns="http://www.cern.ch/cms/csc/exsys/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://www.cern.ch/cms/csc/exsys/wsdl" location="../jbiServiceUnits/CdwBpel/getParameterCollection.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:getParameterCollectionPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="getParameterCollectionOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="Exsys"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="Exsys"/>
            </output>
        </operation>
    </binding>
    <service name="casaService1">
        <port name="getParameterCollection" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/cdw/getParameterCollection"/>
        </port>
    </service>
</definitions>
