EMU/cscdw/Exsys/test/getParameterCollection/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exs="Exsys" xmlns:data="http://www.cern.ch/cms/csc/exsys/data">
  <soapenv:Body>
    <exs:getParameterCollectionOperation>
      <collection>
        <data:source>LOCAL_DQM</data:source>
        <data:parameter>
          <data:time>2007-10-26T08:36:28</data:time>
          <data:run>10</data:run>
          <data:component>ME-1/1/1</data:component>
          <data:parameterId>DATA_EVENTS</data:parameterId>
          <data:numericValue>12345</data:numericValue>
          <data:severity>INFO</data:severity>
        </data:parameter>
        <data:parameter>
          <data:time>2007-10-26T08:36:28</data:time>
          <data:run>10</data:run>
          <data:component>ME-1/1/2</data:component>
          <data:parameterId>DATA_EVENTS</data:parameterId>
          <data:numericValue>1234567890</data:numericValue>
          <data:severity>INFO</data:severity>
        </data:parameter>
        <data:parameter>
          <data:time>2007-10-27T08:36:28</data:time>
          <data:run>10</data:run>
          <data:component>ME-1/1/3</data:component>
          <data:parameterId>DATA_EVENTS</data:parameterId>
          <data:numericValue>120</data:numericValue>
          <data:severity>INFO</data:severity>
        </data:parameter>
        <data:parameter>
          <data:time>2007-10-28T08:36:28</data:time>
          <data:run>10</data:run>
          <data:component>ME-1/1/2</data:component>
          <data:parameterId>DATA_EVENTS</data:parameterId>
          <data:numericValue>7890</data:numericValue>
          <data:severity>INFO</data:severity>
        </data:parameter>
        <data:parameter>
          <data:time>2007-10-30T08:36:28</data:time>
          <data:run>10</data:run>
          <data:component>ME-1/1/2</data:component>
          <data:parameterId>DATA_EVENTS</data:parameterId>
          <data:numericValue>10</data:numericValue>
          <data:severity>INFO</data:severity>
        </data:parameter>
      </collection>
    </exs:getParameterCollectionOperation>
  </soapenv:Body>
</soapenv:Envelope>